tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
#include "server_network_sta_wifi_work_time.h"

#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <errno.h>
#include <stdint.h>
#include <stdlib.h>
#include <time.h>

#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "nvs.h"
#include "ch583_wifi_uart_protocol.h"
#include "epd_display_app.h"
#include "led_status.h"
#include "server_network_sta_slideshow.h"
#include "tdx_cfg.h"

static const char *TAG = "server_sta_wifi_time";
static TickType_t s_wifi_work_start_tick = 0;
static TickType_t s_last_network_data_tick = 0;
static TickType_t s_last_power_off_send_tick = 0;
static TaskHandle_t s_work_state_task = NULL;
static bool s_ota_in_progress = false;

static void format_epoch_local(int64_t epoch, char *buf, size_t buf_size)
{
    if (buf == NULL || buf_size == 0) {
        return;
    }
    time_t t = (time_t)epoch;
    struct tm tm_value = {0};
    localtime_r(&t, &tm_value);
    strftime(buf, buf_size, "%Y-%m-%d %H:%M:%S", &tm_value);
}

// Keep these globals compatible with the old sleep/work-time flow for BLE and HTTP handlers.
uint32_t working_time = 0;
uint32_t server_required_continue_work_time = USER_WORK_STATE_DEFAULT_CONTINUE_SECONDS;
uint32_t wifi_standby_time_s = USER_WORK_STATE_DEFAULT_STANDBY_SECONDS;

// Store all runtime sleep/work values in one NVS blob so future power-mode changes stay centralized.
typedef struct __attribute__((packed)) {
    uint16_t sleep_time_value;
    uint32_t working_time_value;
    uint32_t server_required_continue_work_time_value;
    uint32_t wifi_standby_time_s_value;
} user_work_state_nvs_blob_t;

static uint32_t clamp_continue_seconds(uint32_t seconds)
{
    if (seconds < USER_WORK_STATE_MIN_CONTINUE_SECONDS) {
        return USER_WORK_STATE_MIN_CONTINUE_SECONDS;
    }
    if (seconds > USER_WORK_STATE_MAX_CONTINUE_SECONDS) {
        return USER_WORK_STATE_MAX_CONTINUE_SECONDS;
    }
    return seconds;
}

static void log_work_state_blob(const char *label, const user_work_state_nvs_blob_t *blob)
{
    if (blob == NULL) {
        return;
    }
    ESP_LOGI(TAG,
             "%s sleep_time=%u working_time=%lu continue=%lu standby=%lu",
             label != NULL ? label : "work_state",
             (unsigned int)blob->sleep_time_value,
             (unsigned long)blob->working_time_value,
             (unsigned long)blob->server_required_continue_work_time_value,
             (unsigned long)blob->wifi_standby_time_s_value);
}

static user_work_state_nvs_blob_t make_work_state_blob(void)
{
    user_work_state_nvs_blob_t blob = {
        .sleep_time_value = sleep_time,
        .working_time_value = working_time,
        .server_required_continue_work_time_value = server_required_continue_work_time,
        .wifi_standby_time_s_value = wifi_standby_time_s,
    };
    return blob;
}

static void apply_work_state_blob(const user_work_state_nvs_blob_t *blob)
{
    if (blob == NULL) {
        return;
    }

    sleep_time = blob->sleep_time_value;
    working_time = 0;
    server_required_continue_work_time = clamp_continue_seconds(blob->server_required_continue_work_time_value);
    wifi_standby_time_s = blob->wifi_standby_time_s_value != 0 ?
                          blob->wifi_standby_time_s_value :
                          USER_WORK_STATE_DEFAULT_STANDBY_SECONDS;

    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    ESP_LOGI(TAG,
             "restore globals sleep_time=%u working_time=%lu continue=%lu standby=%lu",
             (unsigned int)sleep_time,
             (unsigned long)working_time,
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
}

static esp_err_t load_work_state_from_nvs(user_work_state_nvs_blob_t *blob, size_t *stored_size)
{
    nvs_handle_t handle = 0;
    size_t size = 0;

    if (blob == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t ret = nvs_open(USER_WORK_STATE_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "open work state nvs failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ret = nvs_get_blob(handle, USER_WORK_STATE_NVS_KEY, NULL, &size);
    if (ret == ESP_OK && size == sizeof(*blob)) {
        ret = nvs_get_blob(handle, USER_WORK_STATE_NVS_KEY, blob, &size);
    } else if (ret == ESP_OK) {
        ESP_LOGW(TAG, "work state blob size mismatch stored=%u expected=%u",
                 (unsigned int)size, (unsigned int)sizeof(*blob));
        ret = ESP_ERR_INVALID_SIZE;
    }
    nvs_close(handle);

    if (stored_size != NULL) {
        *stored_size = size;
    }
    return ret;
}

static esp_err_t save_work_state_to_nvs(void)
{
    nvs_handle_t handle = 0;
    user_work_state_nvs_blob_t blob = make_work_state_blob();

    esp_err_t ret = nvs_open(USER_WORK_STATE_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "open work state nvs for write failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ret = nvs_set_blob(handle, USER_WORK_STATE_NVS_KEY, &blob, sizeof(blob));
    if (ret == ESP_OK) {
        ret = nvs_commit(handle);
    }
    nvs_close(handle);

    if (ret == ESP_OK) {
        user_work_state_nvs_blob_t read_blob = {0};
        size_t stored_size = 0;
        log_work_state_blob("save value", &blob);
        esp_err_t read_ret = load_work_state_from_nvs(&read_blob, &stored_size);
        if (read_ret == ESP_OK && memcmp(&blob, &read_blob, sizeof(blob)) == 0) {
            ESP_LOGI(TAG, "work state verify ok stored_size=%u", (unsigned int)stored_size);
        } else {
            ESP_LOGW(TAG, "work state verify failed read_ret=%s stored_size=%u",
                     esp_err_to_name(read_ret), (unsigned int)stored_size);
        }
    } else {
        ESP_LOGE(TAG, "save work state failed: %s", esp_err_to_name(ret));
    }
    return ret;
}

static bool parse_app_nvs_u32(const char *value, uint32_t *out_value)
{
    char *end_ptr = NULL;
    unsigned long parsed = 0;

    if (value == NULL || out_value == NULL || value[0] == '\0') {
        return false;
    }

