tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
    errno = 0;
    parsed = strtoul(value, &end_ptr, 10);
    if (errno != 0 || end_ptr == value || *end_ptr != '\0' || parsed > UINT32_MAX) {
        return false;
    }

    *out_value = (uint32_t)parsed;
    return true;
}

static esp_err_t save_work_time_vars_to_app_nvs(void)
{
    char value[16];
    esp_err_t ret = ESP_OK;
    esp_err_t write_ret = ESP_OK;

    snprintf(value, sizeof(value), "%lu", (unsigned long)server_required_continue_work_time);
    write_ret = app_nvs_write_str(SERVER_REQUIRED_CONTINUE_WORK_TIME_NVS_KEY, value);
    if (write_ret != ESP_OK && ret == ESP_OK) {
        ret = write_ret;
    }

    snprintf(value, sizeof(value), "%lu", (unsigned long)wifi_standby_time_s);
    write_ret = app_nvs_write_str(WIFI_STANDBY_TIME_S_NVS_KEY, value);
    if (write_ret != ESP_OK && ret == ESP_OK) {
        ret = write_ret;
    }

    ESP_LOGI(TAG, "save app nvs continue=%lu standby=%lu ret=%s",
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s,
             esp_err_to_name(ret));
    return ret;
}

static void load_work_time_vars_from_app_nvs(void)
{
    char value[16];
    char default_value[16];
    uint32_t parsed = 0;

    snprintf(default_value, sizeof(default_value), "%lu",
             (unsigned long)server_required_continue_work_time);
    if (app_nvs_read_str(SERVER_REQUIRED_CONTINUE_WORK_TIME_NVS_KEY,
                         value,
                         sizeof(value),
                         default_value) == ESP_OK &&
        parse_app_nvs_u32(value, &parsed)) {
        server_required_continue_work_time = clamp_continue_seconds(parsed);
    }

    snprintf(default_value, sizeof(default_value), "%lu",
             (unsigned long)wifi_standby_time_s);
    if (app_nvs_read_str(WIFI_STANDBY_TIME_S_NVS_KEY,
                         value,
                         sizeof(value),
                         default_value) == ESP_OK &&
        parse_app_nvs_u32(value, &parsed) &&
        parsed != 0) {
        wifi_standby_time_s = parsed;
    }

    ESP_LOGI(TAG, "load app nvs continue=%lu standby=%lu",
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
}

static uint32_t update_working_time_seconds(void)
{
    TickType_t now = xTaskGetTickCount();
    if (s_wifi_work_start_tick == 0) {
        s_wifi_work_start_tick = now;
    }
    working_time = (uint32_t)(((now - s_wifi_work_start_tick) * portTICK_PERIOD_MS) / 1000U);
    return working_time;
}

//调用   ServerNetworkStaWifiWorkTime_OnNetworkData  从头计
// Configure CH583/CH585 wake timer before POWER_OFF so slideshow can resume after power cut.
static uint32_t slideshow_startup_delay_seconds(void)
{
    return (TDX_SLIDESHOW_STARTUP_DELAY_MS + 999U) / 1000U;
}

static void reset_work_time_counter_for_slideshow_short_interval(void)
{
    s_wifi_work_start_tick = xTaskGetTickCount();
    working_time = 0;
    s_last_power_off_send_tick = 0;
}

static bool configure_ch583_wake_timer_before_power_off(void)
{
    uint32_t interval = TDX_SLIDESHOW_INTERVAL_MIN_SECONDS;
    bool random = false;
    bool slideshow_on = ServerNetworkStaSlideshow_IsSavedEnabled("/data", &interval, &random);
    int wake_ret;

    if (slideshow_on) {
        if (interval < TDX_SLIDESHOW_INTERVAL_MIN_SECONDS ||
            interval > TDX_SLIDESHOW_INTERVAL_MAX_SECONDS) {
            interval = TDX_SLIDESHOW_INTERVAL_MIN_SECONDS;
        }

        uint32_t runtime_interval = 0;
        uint32_t runtime_elapsed = 0;
        bool runtime_running = false;
        uint32_t wake_interval = interval;
        uint32_t startup_delay = slideshow_startup_delay_seconds();
        int64_t schedule_now = 0;
        int64_t schedule_next = 0;
        uint32_t schedule_remain = 0;
        if (ServerNetworkStaSlideshow_GetScheduleTiming(&runtime_interval,
                                                        &schedule_now,
                                                        &schedule_next,
                                                        &schedule_remain,
                                                        &runtime_running) &&
            runtime_running) {
            wake_interval = schedule_remain > 0 ? schedule_remain : 1U;
            runtime_elapsed = runtime_interval > schedule_remain ?
                              runtime_interval - schedule_remain :
                              0;
            char now_text[32] = {0};
            char next_text[32] = {0};
            format_epoch_local(schedule_now, now_text, sizeof(now_text));
            format_epoch_local(schedule_next, next_text, sizeof(next_text));
            ESP_LOGI(TAG,
                     "slideshow rtc wake timing now=%lld(%s) next=%lld(%s) remain=%lu interval=%lu",
                     (long long)schedule_now,
                     now_text,
                     (long long)schedule_next,
                     next_text,
                     (unsigned long)schedule_remain,
                     (unsigned long)runtime_interval);
        } else if (ServerNetworkStaSlideshow_GetRuntimeTiming(&runtime_interval,
                                                              &runtime_elapsed,
                                                              &runtime_running) &&
                   runtime_running &&
                   runtime_interval > 0) {
            wake_interval = runtime_interval > runtime_elapsed ? runtime_interval - runtime_elapsed : 1U;
        }
        wake_interval = wake_interval > startup_delay ? wake_interval - startup_delay : 1U;

        if (wake_interval < TDX_SLIDESHOW_INTERVAL_MIN_SECONDS) {
            reset_work_time_counter_for_slideshow_short_interval();
            ESP_LOGI(TAG,
                     "slideshow wake interval too short, skip power off wake_interval=%lu min=%lu saved_interval=%lu elapsed=%lu startup_delay=%lu",
                     (unsigned long)wake_interval,
                     (unsigned long)TDX_SLIDESHOW_INTERVAL_MIN_SECONDS,
                     (unsigned long)interval,
                     (unsigned long)runtime_elapsed,
                     (unsigned long)startup_delay);
            return false;
        }

