tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
                ESP_LOGI(TAG,
                         "working_time timeout, send CH583 power off elapsed=%lu target=%lu standby=%lu",
                         (unsigned long)elapsed,
                         (unsigned long)server_required_continue_work_time,
                         (unsigned long)wifi_standby_time_s);
                if (!configure_ch583_wake_timer_before_power_off()) {
                    vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
                    continue;
                }
                vTaskDelay(pdMS_TO_TICKS(100));
                UserLedStatus_PreparePowerOff();
                vTaskDelay(pdMS_TO_TICKS(100));
                int power_off_ret = ch583_wifi_uart_send_power_off();
                if (power_off_ret < 0) {
                    ESP_LOGW(TAG, "CH583 power off command failed ret=%d", power_off_ret);
                }
            }
        } else {
            s_last_power_off_send_tick = 0;
        }

        vTaskDelay(pdMS_TO_TICKS(USER_WORK_STATE_TASK_INTERVAL_MS));
    }
}

static const char *find_json_key(const char *body, const char *key)
{
    char pattern[64];
    const char *pos = body;
    if (body == NULL || key == NULL) {
        return NULL;
    }
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    while ((pos = strstr(pos, pattern)) != NULL) {
        const char *after = pos + strlen(pattern);
        while (*after == ' ' || *after == '\t' || *after == '\r' || *after == '\n') {
            after++;
        }
        if (*after == ':') {
            return pos;
        }
        pos += strlen(pattern);
    }
    return NULL;
}

static bool json_func_equals(const char *body, const char *func)
{
    const char *pos = find_json_key(body, "func");
    if (pos == NULL || func == NULL) {
        return false;
    }

    pos += strlen("func") + 2;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != ':') {
        return false;
    }
    pos++;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != '"') {
        return false;
    }
    pos++;

    size_t func_len = strlen(func);
    return strncmp(pos, func, func_len) == 0 && pos[func_len] == '"';
}

static bool parse_json_int(const char *body, const char *key, int *out)
{
    const char *pos = find_json_key(body, key);
    char *end_ptr = NULL;
    long value = 0;
    if (pos == NULL || out == NULL) {
        return false;
    }

    pos += strlen(key) + 2;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }
    if (*pos != ':') {
        return false;
    }
    pos++;
    while (*pos == ' ' || *pos == '\t' || *pos == '\r' || *pos == '\n') {
        pos++;
    }

    errno = 0;
    value = strtol(pos, &end_ptr, 10);
    if (errno != 0 || end_ptr == pos || value < INT32_MIN || value > INT32_MAX) {
        return false;
    }
    *out = (int)value;
    return true;
}

static esp_err_t send_wifi_work_time_result(httpd_req_t *req, int result, const char *message)
{
    char json[176];
    if (result == TDX_JSON_RESULT_OK) {
        snprintf(json, sizeof(json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d}",
                 TDX_JSON_RESULT_OK);
    } else {
        snprintf(json, sizeof(json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"%s\"}",
                 result,
                 message != NULL ? message : "set wifi work time failed");
    }

    ESP_LOGI(TAG, "set_wifi_work_time response: %s", json);
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_sendstr(req, json);
}

void ServerNetworkStaWifiWorkTime_OnNetworkData(void)
{
    working_time = 0;
    s_last_network_data_tick = xTaskGetTickCount();
    s_wifi_work_start_tick = s_last_network_data_tick;
    s_last_power_off_send_tick = 0;
    if (server_required_continue_work_time > 0) {
        ESP_LOGI(TAG, "activity reset working_time continue=%lu elapsed_ms=%u",
                 (unsigned long)server_required_continue_work_time,
                 (unsigned int)((s_last_network_data_tick - s_wifi_work_start_tick) * portTICK_PERIOD_MS));
    }
}

void ServerNetworkStaWifiWorkTime_SetOtaInProgress(bool in_progress)
{
    s_ota_in_progress = in_progress;
    ESP_LOGI(TAG, "ota in progress=%d", in_progress ? 1 : 0);
}

esp_err_t ServerNetworkStaWifiWorkTime_Init(void)
{
    user_work_state_nvs_blob_t blob = {0};
    size_t stored_size = 0;

    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;

    esp_err_t ret = load_work_state_from_nvs(&blob, &stored_size);
    if (ret == ESP_OK) {
        log_work_state_blob("read value", &blob);
        apply_work_state_blob(&blob);
    } else {
        sleep_time = 0;
        working_time = 0;
        server_required_continue_work_time = USER_WORK_STATE_DEFAULT_CONTINUE_SECONDS;
        wifi_standby_time_s = USER_WORK_STATE_DEFAULT_STANDBY_SECONDS;
        ESP_LOGW(TAG, "use default work state ret=%s stored_size=%u continue=%lu standby=%lu",
                 esp_err_to_name(ret), (unsigned int)stored_size,
                 (unsigned long)server_required_continue_work_time,
                 (unsigned long)wifi_standby_time_s);
        ret = save_work_state_to_nvs();
    }

    load_work_time_vars_from_app_nvs();
    esp_err_t app_nvs_ret = save_work_time_vars_to_app_nvs();
    if (ret == ESP_OK && app_nvs_ret != ESP_OK) {
        ret = app_nvs_ret;
    }

    if (s_work_state_task == NULL) {
        BaseType_t task_ret = xTaskCreate(work_state_task,
                                          "work_state",
                                          USER_WORK_STATE_TASK_STACK_SIZE,
                                          NULL,
                                          USER_WORK_STATE_TASK_PRIORITY,
                                          &s_work_state_task);
        if (task_ret != pdPASS) {
            ESP_LOGE(TAG, "create work_state task failed");
            return ESP_ERR_NO_MEM;
        }
    }

    return ret;
}

esp_err_t ServerNetworkStaWifiWorkTime_SetAndSave(uint32_t seconds)
{
    if (seconds == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_work_state_task == NULL) {
        ESP_LOGE(TAG, "set work time apply failed because work_state task is not ready");
        return ESP_ERR_INVALID_STATE;
    }

    server_required_continue_work_time = clamp_continue_seconds(seconds);
    wifi_standby_time_s = seconds;
    working_time = 0;
    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;

