tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
    ESP_LOGI(TAG, "set work time requested=%lu continue=%lu standby=%lu",
             (unsigned long)seconds,
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
    esp_err_t ret = save_work_state_to_nvs();
    esp_err_t app_nvs_ret = save_work_time_vars_to_app_nvs();
    if (ret == ESP_OK && app_nvs_ret != ESP_OK) {
        ret = app_nvs_ret;
    }
    ESP_LOGI(TAG, "set work time save ret=%s app_nvs_ret=%s",
             esp_err_to_name(ret),
             esp_err_to_name(app_nvs_ret));
    return ret;
}

esp_err_t ServerNetworkStaWifiWorkTime_ProcessJson(httpd_req_t *req,
                                                   const char *body,
                                                   size_t body_len)
{
    (void)body_len;
    if (!json_func_equals(body, "set_wifi_work_time")) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    int seconds = 0;
    if (!parse_json_int(body, "seconds", &seconds) &&
        !parse_json_int(body, "time", &seconds)) {
        ESP_LOGW(TAG, "set_wifi_work_time invalid seconds body=%s", body != NULL ? body : "<null>");
        return send_wifi_work_time_result(req,
                                          TDX_JSON_RESULT_WIFI_WORK_TIME_MISSING,
                                          "set wifi work time failed");
    }
    if (seconds < SERVER_NETWORK_STA_WIFI_WORK_TIME_MIN_SECONDS ||
        seconds > SERVER_NETWORK_STA_WIFI_WORK_TIME_MAX_SECONDS) {
        ESP_LOGW(TAG, "set_wifi_work_time seconds out of range seconds=%d body=%s",
                 seconds, body != NULL ? body : "<null>");
        return send_wifi_work_time_result(req,
                                          TDX_JSON_RESULT_WIFI_WORK_TIME_RANGE,
                                          "set wifi work time failed");
    }

    esp_err_t set_ret = ServerNetworkStaWifiWorkTime_SetAndSave((uint32_t)seconds);
    if (set_ret != ESP_OK) {
        ESP_LOGE(TAG, "set_wifi_work_time save failed: %s", esp_err_to_name(set_ret));
        return send_wifi_work_time_result(req,
                                          set_ret == ESP_ERR_INVALID_STATE ?
                                              TDX_JSON_RESULT_WIFI_WORK_TIME_APPLY_FAILED :
                                              TDX_JSON_RESULT_WIFI_WORK_TIME_SAVE_FAILED,
                                          "set wifi work time failed");
    }

    ESP_LOGI(TAG, "set_wifi_work_time updated seconds=%d max=%d working_time=%lu",
             seconds,
             SERVER_NETWORK_STA_WIFI_WORK_TIME_MAX_SECONDS,
             (unsigned long)update_working_time_seconds());
    ESP_LOGI(TAG, "set_wifi_work_time saved, CH583 power-off timeout is enabled");
    return send_wifi_work_time_result(req, TDX_JSON_RESULT_OK, NULL);
}
